name: "resnet50"
platform: "onnxruntime_onnx"
max_batch_size: 1
input [ {
  name: "gpu_0/data_0"
  data_type: TYPE_FP32
  dims: [ -1, 3, 224, 224 ]
} ]
output [ {
  name: "gpu_0/resnet_node_output_0"
  data_type: TYPE_FP32
  dims: [ -1, 1000 ]
} ]
instance_group [ { kind: KIND_CPU } ]
